ningjw/RT1052/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  /* GPIO configuration of LED on GPIO_AD_B0_09 (pin F14) */
  gpio_pin_config_t LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_09 (pin F14) */
  GPIO_PinInit(GPIO1, 9U, &LED_config);

  /* GPIO configuration of BTM_MODE on GPIO_AD_B0_10 (pin G13) */
  gpio_pin_config_t BTM_MODE_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_10 (pin G13) */
  GPIO_PinInit(GPIO1, 10U, &BTM_MODE_config);

  /* GPIO configuration of E103_SETDF on GPIO_AD_B0_11 (pin G10) */
  gpio_pin_config_t E103_SETDF_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_11 (pin G10) */
  GPIO_PinInit(GPIO1, 11U, &E103_SETDF_config);

  /* GPIO configuration of E103_RST on GPIO_AD_B0_14 (pin H14) */
  gpio_pin_config_t E103_RST_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_14 (pin H14) */
  GPIO_PinInit(GPIO1, 14U, &E103_RST_config);

  /* GPIO configuration of BTM_EN on GPIO_AD_B1_04 (pin L12) */
  gpio_pin_config_t BTM_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_04 (pin L12) */
  GPIO_PinInit(GPIO1, 20U, &BTM_EN_config);

  /* GPIO configuration of E103_PWR_EN on GPIO_AD_B1_05 (pin K12) */
  gpio_pin_config_t E103_PWR_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_05 (pin K12) */
  GPIO_PinInit(GPIO1, 21U, &E103_PWR_EN_config);

  /* GPIO configuration of ADC_RDY on GPIO_B0_04 (pin C8) */
  gpio_pin_config_t ADC_RDY_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntFallingEdge
  };
  /* Initialize GPIO functionality on GPIO_B0_04 (pin C8) */
  GPIO_PinInit(GPIO2, 4U, &ADC_RDY_config);
  /* Enable GPIO pin interrupt on GPIO_B0_04 (pin C8) */
  GPIO_PortEnableInterrupts(GPIO2, 1U << 4U);

  /* GPIO configuration of ADC_MODE on GPIO_B0_11 (pin A10) */
  gpio_pin_config_t ADC_MODE_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_11 (pin A10) */
  GPIO_PinInit(GPIO2, 11U, &ADC_MODE_config);

  /* GPIO configuration of ADC_SYNC on GPIO_B0_14 (pin E10) */
  gpio_pin_config_t ADC_SYNC_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_14 (pin E10) */
  GPIO_PinInit(GPIO2, 14U, &ADC_SYNC_config);

  /* GPIO configuration of ADC_FORMAT on GPIO_B0_15 (pin E11) */
  gpio_pin_config_t ADC_FORMAT_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_15 (pin E11) */
  GPIO_PinInit(GPIO2, 15U, &ADC_FORMAT_config);

  /* GPIO configuration of LED_PWR_RED on GPIO_B1_04 (pin E12) */
  gpio_pin_config_t LED_PWR_RED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_04 (pin E12) */
  GPIO_PinInit(GPIO2, 20U, &LED_PWR_RED_config);

  /* GPIO configuration of LED_PWR_GREEN on GPIO_B1_05 (pin D12) */
  gpio_pin_config_t LED_PWR_GREEN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_05 (pin D12) */
  GPIO_PinInit(GPIO2, 21U, &LED_PWR_GREEN_config);

  /* GPIO configuration of LED_BAT_RED on GPIO_B1_06 (pin C12) */
  gpio_pin_config_t LED_BAT_RED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_06 (pin C12) */
  GPIO_PinInit(GPIO2, 22U, &LED_BAT_RED_config);

  /* GPIO configuration of LED_BAT_GREEN on GPIO_B1_07 (pin B12) */
  gpio_pin_config_t LED_BAT_GREEN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_07 (pin B12) */
  GPIO_PinInit(GPIO2, 23U, &LED_BAT_GREEN_config);

  /* GPIO configuration of LED_BLE_RED on GPIO_B1_08 (pin A12) */
  gpio_pin_config_t LED_BLE_RED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_08 (pin A12) */
  GPIO_PinInit(GPIO2, 24U, &LED_BLE_RED_config);

  /* GPIO configuration of LED_BLE_GREEN on GPIO_B1_09 (pin A13) */
  gpio_pin_config_t LED_BLE_GREEN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_09 (pin A13) */
  GPIO_PinInit(GPIO2, 25U, &LED_BLE_GREEN_config);

  /* GPIO configuration of LED_SYS_RED on GPIO_B1_10 (pin B13) */
  gpio_pin_config_t LED_SYS_RED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_10 (pin B13) */
  GPIO_PinInit(GPIO2, 26U, &LED_SYS_RED_config);

